Repository: muhittincamdali/SwiftIntelligence
Catalog: Sources/SwiftIntelligenceCore/Resources/*.lproj/Localizable.strings
Languages: tr

# framework.description
source: Advanced AI/ML Framework for Apple Platforms
tr: Apple Platformları için Gelişmiş AI/ML Framework'ü

# framework.version
source: Version
tr: Sürüm

# initialization.starting
source: Initializing SwiftIntelligence...
tr: SwiftIntelligence başlatılıyor...

# initialization.complete
source: SwiftIntelligence initialized successfully
tr: SwiftIntelligence başarıyla başlatıldı

# initialization.failed
source: Failed to initialize SwiftIntelligence
tr: SwiftIntelligence başlatılamadı

source: Engine Ready
tr: Motor Hazır

# engine.initializing
source: Initializing Engine
tr: Motor Başlatılıyor

source: Engine Error
tr: Motor Hatası

source: Engine Shutdown
tr: Motor Kapatıldı

source: Engine Unavailable
tr: Motor Kullanılamıyor

# nlp.analyzing
source: Analyzing text...
tr: Metin analiz ediliyor...

# nlp.sentiment.positive
source: Positive
tr: Pozitif

# nlp.sentiment.negative
source: Negative
tr: Negatif

# nlp.sentiment.neutral
source: Neutral
tr: Nötr

# nlp.language.detected
source: Language detected
tr: Dil tespit edildi

# nlp.entities.found
source: entities found
tr: varlık bulundu

# nlp.processing.complete
source: Text processing complete
tr: Metin işleme tamamlandı

# vision.processing
source: Processing image...
tr: Görüntü işleniyor...

# vision.objects.detected
source: objects detected
tr: nesne tespit edildi

# vision.faces.detected
source: faces detected
tr: yüz tespit edildi

# vision.text.recognized
source: Text recognized
tr: Metin tanındı

# vision.classification.complete
source: Image classification complete
tr: Görüntü sınıflandırması tamamlandı

# speech.listening
source: Listening...
tr: Dinleniyor...

# speech.recognition.starting
source: Starting speech recognition
tr: Konuşma tanıma başlatılıyor

source: Speech recognition stopped
tr: Konuşma tanıma durduruldu

# speech.synthesis.starting
source: Starting text-to-speech
tr: Metin-konuşma başlatılıyor

source: Speech synthesis complete
tr: Konuşma sentezi tamamlandı

# speech.permission.required
source: Speech recognition permission required
tr: Konuşma tanıma izni gerekli

# ml.training
source: Training model...
tr: Model eğitiliyor...

# ml.prediction
source: Making prediction...
tr: Tahmin yapılıyor...

# ml.model.loaded
source: Model loaded successfully
tr: Model başarıyla yüklendi

# ml.model.failed
source: Failed to load model
tr: Model yüklenemedi

# privacy.protecting
source: Protecting sensitive data...
tr: Hassas veriler korunuyor...

# privacy.anonymizing
source: Anonymizing data...
tr: Veriler anonimleştiriliyor...

# privacy.encrypting
source: Encrypting data...
tr: Veriler şifreleniyor...

# privacy.compliance.check
source: Checking compliance
tr: Uyumluluk kontrol ediliyor

# error.general
source: An error occurred
tr: Bir hata oluştu

# error.network
source: Network error
tr: Ağ hatası

# error.permission.denied
source: Permission denied
tr: İzin reddedildi

# error.invalid.input
source: Invalid input
tr: Geçersiz giriş

# error.processing.failed
source: Processing failed
tr: İşlem başarısız

# error.model.unavailable
source: Model unavailable
tr: Model kullanılamıyor

# error.unsupported.platform
source: Unsupported platform
tr: Desteklenmeyen platform

# performance.excellent
source: Excellent
tr: Mükemmel

# performance.good
source: Good
tr: İyi

# performance.average
source: Average
tr: Ortalama

# performance.poor
source: Poor
tr: Zayıf

# performance.measuring
source: Measuring performance...
tr: Performans ölçülüyor...

# cache.loading
source: Loading from cache...
tr: Önbellekten yükleniyor...

# cache.saving
source: Saving to cache...
tr: Önbelleğe kaydediliyor...

source: Cache cleared
tr: Önbellek temizlendi

source: Cache full
tr: Önbellek dolu

# network.connecting
source: Connecting...
tr: Bağlanıyor...

# network.connected
source: Connected
tr: Bağlandı

# network.disconnected
source: Disconnected
tr: Bağlantı kesildi

# network.slow
source: Slow connection detected
tr: Yavaş bağlantı tespit edildi

# validation.success
source: Validation successful
tr: Doğrulama başarılı

source: Validation failed
tr: Doğrulama başarısız

source: Validation warning
tr: Doğrulama uyarısı

# ui.loading
source: Loading...
tr: Yükleniyor...

# ui.processing
source: Processing...
tr: İşleniyor...

# ui.complete
source: Complete
tr: Tamamlandı

# ui.cancel
source: Cancel
tr: İptal

# ui.retry
source: Retry
tr: Tekrar Dene

# ui.settings
source: Settings
tr: Ayarlar

# time.seconds
source: seconds
tr: saniye

# time.minutes
source: minutes
tr: dakika

# time.hours
source: hours
tr: saat

# time.estimated
source: Estimated time
tr: Tahmini süre

# data.bytes
source: bytes
tr: bayt

# accessibility.ai.processing
source: AI processing in progress
tr: AI işlemi devam ediyor

# accessibility.image.analyzing
source: Analyzing image content
tr: Görüntü içeriği analiz ediliyor

# accessibility.speech.listening
source: Listening for speech input
tr: Konuşma girişi dinleniyor

# accessibility.text.processing
source: Processing text content
tr: Metin içeriği işleniyor
